# omakase-mac — declarative package manifest
# Apply with: brew bundle --file=Brewfile
# Refresh after adding tools; keep this list curated and intentional.

# --- Taps ---
tap "nikitabobko/tap"                 # AeroSpace tiling window manager

# --- CLI core ---
brew "stow"                           # symlink farm manager (config layer)
brew "neovim"                         # editor / IDE (LazyVim)
brew "tmux"                           # terminal multiplexer
brew "starship"                       # cross-shell prompt
brew "eza"                            # modern ls
brew "bat"                            # modern cat
brew "fzf"                            # fuzzy finder
brew "ripgrep"                        # fast search (rg)
brew "fd"                             # fast find
brew "zoxide"                         # smarter cd (z)
brew "lazygit"                        # terminal git UI
brew "git"                            # modern git over Apple's bundled build

# --- Networking ---
brew "tailscale"                      # mesh VPN (already in use — preserved)

# --- GUI apps ---
cask "ghostty"                        # GPU-accelerated terminal
cask "nikitabobko/tap/aerospace"      # i3-like tiling WM
cask "raycast"                        # launcher / Spotlight replacement (cmd+space)

# --- Fonts ---
cask "font-0xproto-nerd-font"
cask "font-geist-mono-nerd-font"
